---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetProperties
source: html/45955e9d-7dd4-b06c-f71a-f9ae2cc1c34a.htm
---
# Autodesk.Revit.DB.Visual.AssetProperties

Represents a set of asset property(s).

## Syntax (C#)
```csharp
public class AssetProperties : AssetProperty
```